###############################################################
#  Generated by:      Cadence Innovus 16.20-p002_1
#  OS:                Linux x86_64(Host ID finagle.wot.ece.northwestern.edu)
#  Generated on:      Sat Mar  7 17:19:24 2026
#  Design:            nn_top
#  Command:           saveDesign nn_top_final.enc
###############################################################
current_design nn_top
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.1  [get_ports {in_full}]
set_load -pin_load -min  0.1  [get_ports {in_full}]
set_load -pin_load -max  0.1  [get_ports {inference_done}]
set_load -pin_load -min  0.1  [get_ports {inference_done}]
set_load -pin_load -max  0.1  [get_ports {predicted_class[3]}]
set_load -pin_load -min  0.1  [get_ports {predicted_class[3]}]
set_load -pin_load -max  0.1  [get_ports {predicted_class[2]}]
set_load -pin_load -min  0.1  [get_ports {predicted_class[2]}]
set_load -pin_load -max  0.1  [get_ports {predicted_class[1]}]
set_load -pin_load -min  0.1  [get_ports {predicted_class[1]}]
set_load -pin_load -max  0.1  [get_ports {predicted_class[0]}]
set_load -pin_load -min  0.1  [get_ports {predicted_class[0]}]
set_load -pin_load -max  0.1  [get_ports {max_score[15]}]
set_load -pin_load -min  0.1  [get_ports {max_score[15]}]
set_load -pin_load -max  0.1  [get_ports {max_score[14]}]
set_load -pin_load -min  0.1  [get_ports {max_score[14]}]
set_load -pin_load -max  0.1  [get_ports {max_score[13]}]
set_load -pin_load -min  0.1  [get_ports {max_score[13]}]
set_load -pin_load -max  0.1  [get_ports {max_score[12]}]
set_load -pin_load -min  0.1  [get_ports {max_score[12]}]
set_load -pin_load -max  0.1  [get_ports {max_score[11]}]
set_load -pin_load -min  0.1  [get_ports {max_score[11]}]
set_load -pin_load -max  0.1  [get_ports {max_score[10]}]
set_load -pin_load -min  0.1  [get_ports {max_score[10]}]
set_load -pin_load -max  0.1  [get_ports {max_score[9]}]
set_load -pin_load -min  0.1  [get_ports {max_score[9]}]
set_load -pin_load -max  0.1  [get_ports {max_score[8]}]
set_load -pin_load -min  0.1  [get_ports {max_score[8]}]
set_load -pin_load -max  0.1  [get_ports {max_score[7]}]
set_load -pin_load -min  0.1  [get_ports {max_score[7]}]
set_load -pin_load -max  0.1  [get_ports {max_score[6]}]
set_load -pin_load -min  0.1  [get_ports {max_score[6]}]
set_load -pin_load -max  0.1  [get_ports {max_score[5]}]
set_load -pin_load -min  0.1  [get_ports {max_score[5]}]
set_load -pin_load -max  0.1  [get_ports {max_score[4]}]
set_load -pin_load -min  0.1  [get_ports {max_score[4]}]
set_load -pin_load -max  0.1  [get_ports {max_score[3]}]
set_load -pin_load -min  0.1  [get_ports {max_score[3]}]
set_load -pin_load -max  0.1  [get_ports {max_score[2]}]
set_load -pin_load -min  0.1  [get_ports {max_score[2]}]
set_load -pin_load -max  0.1  [get_ports {max_score[1]}]
set_load -pin_load -min  0.1  [get_ports {max_score[1]}]
set_load -pin_load -max  0.1  [get_ports {max_score[0]}]
set_load -pin_load -min  0.1  [get_ports {max_score[0]}]
set_load -pin_load -max  0.1  [get_ports {VDD}]
set_load -pin_load -min  0.1  [get_ports {VDD}]
set_load -pin_load -max  0.1  [get_ports {VSS}]
set_load -pin_load -min  0.1  [get_ports {VSS}]
set_max_transition 0.5  [get_designs {nn_top}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[15]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[13]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[11]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {VSS}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[9]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[7]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[5]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[14]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[12]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[10]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {VDD}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {wr_en}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[8]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[6]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {din[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[9]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {inference_done}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {predicted_class[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {VSS}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[15]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {predicted_class[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[13]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[11]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {in_full}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[8]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[4]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {predicted_class[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {VDD}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[14]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {predicted_class[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[12]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {max_score[10]}]
